### "Movies" table

In [2]:
%%bigquery
SELECT COUNT(*) FROM imdb_staging.Movies

     f0_
0  81273

In [14]:
%%bigquery
SELECT COUNT(DISTINCT imdb_title_id) FROM imdb_staging.Movies

     f0_
0  81273

### "Names" Table

In [4]:
%%bigquery
SELECT COUNT(*) FROM imdb_staging.Names

      f0_
0  175715

In [15]:
%%bigquery
SELECT COUNT(DISTINCT imdb_name_id) FROM imdb_staging.Names

      f0_
0  175715

### "Ratings" Table

In [9]:
%%bigquery
SELECT COUNT(*) FROM imdb_staging.Ratings

      f0_
0  243819

In [16]:
%%bigquery
SELECT COUNT(DISTINCT imdb_title_id) FROM imdb_staging.Ratings

     f0_
0  81273

In [21]:
%%bigquery
SELECT COUNT(*)
FROM imdb_staging.Ratings r LEFT JOIN imdb_staging.Movies m ON r.imdb_title_id = m.imdb_title_id
WHERE m.imdb_title_id IS NULL

   f0_
0    0

### "Title Principals" Table

In [11]:
%%bigquery
SELECT COUNT(*) FROM imdb_staging.Title_Principals

      f0_
0  377848

In [17]:
%%bigquery
SELECT COUNT(DISTINCT imdb_title_id) FROM imdb_staging.Title_Principals

     f0_
0  38800

In [18]:
%%bigquery
SELECT COUNT(DISTINCT imdb_name_id) FROM imdb_staging.Title_Principals

      f0_
0  175715

In [19]:
%%bigquery
SELECT COUNT(*)
FROM imdb_staging.Title_Principals t LEFT JOIN imdb_staging.Movies m ON t.imdb_title_id = m.imdb_title_id
WHERE m.imdb_title_id IS NULL

   f0_
0   10

In [20]:
%%bigquery
SELECT COUNT(*)
FROM imdb_staging.Title_Principals t LEFT JOIN imdb_staging.Names n ON t.imdb_name_id = n.imdb_name_id
WHERE n.imdb_name_id is NULL

   f0_
0    0